of2306/buoyantBoussinesqSimpleFoam/hotRoom/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              1e-05;

// Thermal expansion coefficient
beta            3e-03;

// Reference temperature
TRef            300;

// Laminar Prandtl number
Pr              0.7;

// Turbulent Prandtl number
Prt             0.85;


// For HTSJ
//    Added for wall heat flux calc
//
// rho0 value needed for wallHeatFluxIncompressible
rho0             [1 -3 0 0 0 0 0] 1.1763;
// Cp0 value needed for wallHeatFluxIncompressible
Cp0              [0 2 -2 -1 0 0 0] 1.007e3;

// ************************************************************************* //
