of2306/buoyantBoussinesqSimpleFoam/hotRoom/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            (sampling);
interpolationScheme cellPointFace;
setFormat       raw;

fields          ( T U );

sets
{
    y0
    {
        type            face;
        axis            z;
        start           (5 0 0);
        end             (5 0 10);
    }
    y1
    {
        type            face;
        axis            z;
        start           (5 1 0);
        end             (5 1 10);
    }
    y2
    {
        type            face;
        axis            z;
        start           (5 2 0);
        end             (5 2 10);
    }
    y3
    {
        type            face;
        axis            z;
        start           (5 3 0);
        end             (5 3 10);
    }
    y4
    {
        type            face;
        axis            z;
        start           (5 4 0);
        end             (5 4 10);
    }
    y5
    {
        type            face;
        axis            z;
        start           (5 5 0);
        end             (5 5 10);
    }
}


// ************************************************************************* //
